# 第3章：建立與保存DataFrame

## 3.1 從無到有建立DataFrame

In [1]:
import pandas as pd
import numpy as np
# pd.set_option('max_columns', 4, 'max_rows', 10, 'max_colwidth', 12)

fname = ['Paul', 'John', 'Richard', 'George']
lname = ['McCartney', 'Lennon', 'Starkey', 'Harrison']
birth = [1942, 1940, 1940, 1943]

In [3]:
people = {'first': fname, 'last': lname, 'birth': birth}

In [4]:
beatles = pd.DataFrame(people)
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [5]:
beatles.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
pd.DataFrame(people, index=['a', 'b', 'c', 'd'])

     first       last  birth
a     Paul  McCartney   1942
b     John     Lennon   1940
c  Richard    Starkey   1940
d   George   Harrison   1943

In [7]:
pd.DataFrame([{"first":"Paul","last":"McCartney", "birth":1942},
              {"first":"John","last":"Lennon", "birth":1940},
              {"first":"Richard","last":"Starkey", "birth":1940},
              {"first":"George","last":"Harrison", "birth":1943}])

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [8]:
pd.DataFrame([{"first":"Paul","last":"McCartney", "birth":1942},
              {"first":"John","last":"Lennon", "birth":1940},
              {"first":"Richard","last":"Starkey", "birth":1940},
              {"first":"George","last":"Harrison", "birth":1943}],
              columns=['last', 'first', 'birth'])

        last    first  birth
0  McCartney     Paul   1942
1     Lennon     John   1940
2    Starkey  Richard   1940
3   Harrison   George   1943

## 3.2 存取CSV檔案

In [9]:
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [10]:
from io import StringIO
fout = StringIO()
beatles.to_csv(fout)

In [11]:
print(fout.getvalue())

,first,last,birth
0,Paul,McCartney,1942
1,John,Lennon,1940
2,Richard,Starkey,1940
3,George,Harrison,1943

In [12]:
fout.seek(0)
pd.read_csv(fout)

   Unnamed: 0    first       last  birth
0           0     Paul  McCartney   1942
1           1     John     Lennon   1940
2           2  Richard    Starkey   1940
3           3   George   Harrison   1943

In [13]:
_ = fout.seek(0)
pd.read_csv(fout, index_col=0)

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [14]:
fout = StringIO()
beatles.to_csv(fout, index=False) 
print(fout.getvalue())

first,last,birth
Paul,McCartney,1942
John,Lennon,1940
Richard,Starkey,1940
George,Harrison,1943

## 3.3 讀取大型的CSV檔案

In [15]:
diamonds = pd.read_csv('data/diamonds.csv', nrows=1000)
diamonds

     carat      cut color clarity  depth  table  price     x     y     z
0     0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1     0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2     0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3     0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4     0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
..     ...      ...   ...     ...    ...    ...    ...   ...   ...   ...
995   0.54    Ideal     D    VVS2   61.4   52.0   2897  5.30  5.34  3.26
996   0.72    Ideal     E     SI1   62.5   55.0   2897  5.69  5.74  3.57
997   0.72     Good     F     VS1   59.4   61.0   2897  5.82  5.89  3.48
998   0.74  Premium     D     VS2   61.8   58.0   2897  5.81  5.77  3.58
999   1.12  Premium     J     SI2   60.6   59.0   2898  6.68  6.61  4.03

[1000 rows x 10 columns]

In [16]:
diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float64
 1   cut      1000 non-null   object
 2   color    1000 non-null   object
 3   clarity  1000 non-null   object
 4   depth    1000 non-null   float64
 5   table    1000 non-null   float64
 6   price    1000 non-null   int64
 7   x        1000 non-null   float64
 8   y        1000 non-null   float64
 9   z        1000 non-null   float64
dtypes: float64(6), int64(1), object(3)
memory usage: 78.2+ KB

In [17]:
diamonds2 = pd.read_csv('data/diamonds.csv', nrows=1000,
                        dtype={'carat': np.float32, 'depth': np.float32,
                               'table': np.float32, 'x': np.float32,
                               'y': np.float32, 'z': np.float32,
                               'price': np.int16})

diamonds2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   object
 2   color    1000 non-null   object
 3   clarity  1000 non-null   object
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
 7   x        1000 non-null   float32
 8   y        1000 non-null   float32
 9   z        1000 non-null   float32
dtypes: float32(6), int16(1), object(3)
memory usage: 49.0+ KB

In [18]:
diamonds.describe()

,carat,depth,table,price,x,y,z
count,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000
mean,0.689280,61.722800,57.734700,2476.54000,5.605940,5.599180,3.457530
std,0.195291,1.758879,2.467946,839.57562,0.625173,0.611974,0.389819
min,0.200000,53.000000,52.000000,326.00000,3.790000,3.750000,2.270000
25%,0.700000,60.900000,56.000000,2777.00000,5.640000,5.630000,3.450000
50%,0.710000,61.800000,57.000000,2818.00000,5.770000,5.760000,3.550000
75%,0.790000,62.600000,59.000000,2856.00000,5.920000,5.910000,3.640000
max,1.270000,69.500000,70.000000,2898.00000,7.120000,7.050000,4.330000

In [19]:
diamonds2.describe()

,carat,depth,table,price,x,y,z
count,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000
mean,0.689281,61.722824,57.734699,2476.54000,5.605941,5.599180,3.457533
std,0.195291,1.758878,2.467944,839.57562,0.625173,0.611972,0.389819
min,0.200000,53.000000,52.000000,326.00000,3.790000,3.750000,2.270000
25%,0.700000,60.900002,56.000000,2777.00000,5.640000,5.630000,3.450000
50%,0.710000,61.799999,57.000000,2818.00000,5.770000,5.760000,3.550000
75%,0.790000,62.599998,59.000000,2856.00000,5.920000,5.910000,3.640000
max,1.270000,69.500000,70.000000,2898.00000,7.120000,7.050000,4.330000

In [20]:
diamonds2.cut.value_counts()

Ideal        333
Premium      290
Very Good    226
Good          89
Fair          62
Name: cut, dtype: int64

In [21]:
diamonds2.color.value_counts()

E    240
F    226
G    139
D    129
H    125
I     95
J     46
Name: color, dtype: int64

In [22]:
diamonds2.clarity.value_counts()

SI1     306
VS2     218
VS1     159
SI2     154
VVS2     62
VVS1     58
I1       29
IF       14
Name: clarity, dtype: int64

In [23]:
diamonds3 = pd.read_csv('data/diamonds.csv', nrows=1000,
                        dtype={'carat': np.float32, 'depth': np.float32,
                               'table': np.float32, 'x': np.float32,
                               'y': np.float32, 'z': np.float32,
                               'price': np.int16,
                               'cut': 'category', 'color': 'category',
                               'clarity': 'category'})

diamonds3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   category
 2   color    1000 non-null   category
 3   clarity  1000 non-null   category
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
 7   x        1000 non-null   float32
 8   y        1000 non-null   float32
 9   z        1000 non-null   float32
dtypes: category(3), float32(6), int16(1)
memory usage: 29.4 KB

In [24]:
cols = ['carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price']
diamonds4 = pd.read_csv('data/diamonds.csv', nrows=1000,
                        dtype={'carat': np.float32, 'depth': np.float32,
                               'table': np.float32, 'price': np.int16,
                               'cut': 'category', 'color': 'category',
                               'clarity': 'category'},
                        usecols=cols)

diamonds4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   category
 2   color    1000 non-null   category
 3   clarity  1000 non-null   category
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
dtypes: category(3), float32(3), int16(1)
memory usage: 17.6 KB

In [25]:
cols = ['carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price']
diamonds_iter = pd.read_csv('data/diamonds.csv', nrows=1000,
                            dtype={'carat': np.float32, 'depth': np.float32,
                                   'table': np.float32, 'price': np.int16,
                                   'cut': 'category', 'color': 'category',
                                   'clarity': 'category'},
                            usecols=cols,
                            chunksize=200)

def process(df):
    return f'processed {df.size} items'

for chunk in diamonds_iter:
    process(chunk)

In [26]:
np.iinfo(np.int8)

iinfo(min=-128, max=127, dtype=int8)

### 小編補充

In [27]:
diamonds4['price'].min()

326

In [28]:
diamonds4['price'].max()

2898

In [29]:
np.finfo(np.float16)

finfo(resolution=0.001, min=-6.55040e+04, max=6.55040e+04, dtype=float16)

In [30]:
diamonds.price.memory_usage()

8128

In [31]:
diamonds.price.memory_usage(index=False)

8000

In [32]:
diamonds.cut.memory_usage(deep=True)

63461

In [33]:
!pip install pyarrow

Requirement already satisfied: pyarrow in c:\users\aaronhsu\miniconda38\lib\site-packages (3.0.0)

WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)

Requirement already satisfied: numpy>=1.16.6 in c:\users\aaronhsu\miniconda38\lib\site-packages (from pyarrow) (1.21.5)

In [34]:
diamonds4.to_feather('d.arr')
diamonds5 = pd.read_feather('d.arr')

In [35]:
diamonds4.to_parquet('d.pqt')

## 3.4 使用Excel檔案

In [36]:
!pip install xlwt

Collecting xlwt
  Downloading xlwt-1.3.0-py2.py3-none-any.whl (99 kB)
     ------------------------------------ 100.0/100.0 kB 571.6 kB/s eta 0:00:00
Installing collected packages: xlwt
Successfully installed xlwt-1.3.0

WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)

In [37]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\aaronhsu\miniconda38\lib\site-packages (3.0.9)
Requirement already satisfied: et-xmlfile in c:\users\aaronhsu\miniconda38\lib\site-packages (from openpyxl) (1.0.1)

WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)

In [38]:
!pip install xlrd

Collecting xlrd
  Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
     -------------------------------------- 96.5/96.5 kB 918.0 kB/s eta 0:00:00
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1

WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)

In [39]:
beatles.to_excel('beat.xls')

C:\Users\aaronhsu\AppData\Local\Temp\ipykernel_8896\4277668329.py:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  beatles.to_excel('beat.xls')

In [40]:
beatles.to_excel('beat.xlsx')

In [41]:
beat2 = pd.read_excel('beat.xls')
beat2

   Unnamed: 0    first       last  birth
0           0     Paul  McCartney   1942
1           1     John     Lennon   1940
2           2  Richard    Starkey   1940
3           3   George   Harrison   1943

In [42]:
beat2 = pd.read_excel('beat.xls', index_col=0)
beat2

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [43]:
beat2.dtypes

first    object
last     object
birth     int64
dtype: object

In [44]:
xl_writer = pd.ExcelWriter('beat.xlsx')
beatles.to_excel(xl_writer, sheet_name='All')
beatles[beatles.birth < 1941].to_excel(xl_writer, sheet_name='1940')
xl_writer.save()

## 3.5 讀取ZIP檔案中的資料

In [45]:
autos = pd.read_csv('data/vehicles_csv.zip')
autos

C:\Users\aaronhsu\AppData\Local\Temp\ipykernel_8896\4083284062.py:1: DtypeWarning: Columns (70,71,72,73,74,76,79) have mixed types. Specify dtype option on import or set low_memory=False.
  autos = pd.read_csv('data/vehicles_csv.zip')

,barrels08,barrelsA08,charge120,charge240,city08,city08U,cityA08,cityA08U,cityCD,cityE,...,mfrCode,c240Dscr,charge240b,c240bDscr,createdOn,modifiedOn,startStop,phevCity,phevHwy,phevComb
0,15.695714,0.0,0.0,0.0,19,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
1,29.964545,0.0,0.0,0.0,9,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
2,12.207778,0.0,0.0,0.0,23,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
3,29.964545,0.0,0.0,0.0,10,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
4,17.347895,0.0,0.0,0.0,17,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
39096,14.982273,0.0,0.0,0.0,19,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
39097,14.330870,0.0,0.0,0.0,20,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
39098,15.695714,0.0,0.0,0.0,18,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
39099,15.695714,0.0,0.0,0.0,18,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
39100,18.311667,0.0,0.0,0.0,16,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0

In [46]:
autos.modifiedOn.dtype

dtype('O')

In [47]:
autos.modifiedOn

0        Tue Jan 01 00:00:00 EST 2013
1        Tue Jan 01 00:00:00 EST 2013
2        Tue Jan 01 00:00:00 EST 2013
3        Tue Jan 01 00:00:00 EST 2013
4        Tue Jan 01 00:00:00 EST 2013
                     ...
39096    Tue Jan 01 00:00:00 EST 2013
39097    Tue Jan 01 00:00:00 EST 2013
39098    Tue Jan 01 00:00:00 EST 2013
39099    Tue Jan 01 00:00:00 EST 2013
39100    Tue Jan 01 00:00:00 EST 2013
Name: modifiedOn, Length: 39101, dtype: object

In [48]:
pd.to_datetime(autos.modifiedOn)

C:\Users\aaronhsu\miniconda38\lib\site-packages\dateutil\parser\_parser.py:1207: UnknownTimezoneWarning: tzname EST identified but not understood.  Pass `tzinfos` argument in order to correctly return a timezone-aware datetime.  In a future version, this will raise an exception.
  warnings.warn("tzname {tzname} identified but not understood.  "
C:\Users\aaronhsu\miniconda38\lib\site-packages\dateutil\parser\_parser.py:1207: UnknownTimezoneWarning: tzname EDT identified but not understood.  Pass `tzinfos` argument in order to correctly return a timezone-aware datetime.  In a future version, this will raise an exception.
  warnings.warn("tzname {tzname} identified but not understood.  "

0       2013-01-01
1       2013-01-01
2       2013-01-01
3       2013-01-01
4       2013-01-01
           ...
39096   2013-01-01
39097   2013-01-01
39098   2013-01-01
39099   2013-01-01
39100   2013-01-01
Name: modifiedOn, Length: 39101, dtype: datetime64[ns]

In [49]:
autos = pd.read_csv('data/vehicles.csv.zip', parse_dates=['modifiedOn'])  
autos.modifiedOn

C:\Users\aaronhsu\AppData\Local\Temp\ipykernel_8896\1513595345.py:1: DtypeWarning: Columns (70,71,72,73,74,76,79) have mixed types. Specify dtype option on import or set low_memory=False.
  autos = pd.read_csv('data/vehicles.csv.zip', parse_dates=['modifiedOn'])
C:\Users\aaronhsu\miniconda38\lib\site-packages\dateutil\parser\_parser.py:1207: UnknownTimezoneWarning: tzname EST identified but not understood.  Pass `tzinfos` argument in order to correctly return a timezone-aware datetime.  In a future version, this will raise an exception.
  warnings.warn("tzname {tzname} identified but not understood.  "
C:\Users\aaronhsu\miniconda38\lib\site-packages\dateutil\parser\_parser.py:1207: UnknownTimezoneWarning: tzname EDT identified but not understood.  Pass `tzinfos` argument in order to correctly return a timezone-aware datetime.  In a future version, this will raise an exception.
  warnings.warn("tzname {tzname} identified but not understood.  "

0       2013-01-01
1       2013-01-01
2       2013-01-01
3       2013-01-01
4       2013-01-01
           ...
39096   2013-01-01
39097   2013-01-01
39098   2013-01-01
39099   2013-01-01
39100   2013-01-01
Name: modifiedOn, Length: 39101, dtype: datetime64[ns]

In [50]:
import zipfile

In [51]:
with zipfile.ZipFile('data/kaggle-survey-2018.zip') as z:
    print('\n'.join(z.namelist()))
    kag = pd.read_csv(z.open('multipleChoiceResponses.csv'))
    kag_questions = kag.iloc[0]
    survey = kag.iloc[1:]

multipleChoiceResponses.csv
freeFormResponses.csv
SurveySchema.csv

C:\Users\aaronhsu\AppData\Local\Temp\ipykernel_8896\3337658071.py:3: DtypeWarning: Columns (0,2,8,10,21,23,24,25,26,27,28,44,56,64,83,85,87,107,109,123,125,150,157,172,174,194,210,218,219,223,246,249,262,264,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,304,306,325,326,329,341,368,371,384,385,389,390,391,393,394) have mixed types. Specify dtype option on import or set low_memory=False.
  kag = pd.read_csv(z.open('multipleChoiceResponses.csv'))

In [52]:
survey.head(2).T

                                                            1          2
Time from Start to Finish (seconds)                       710        434
Q1                                                     Female       Male
Q1_OTHER_TEXT                                              -1         -1
Q2                                                      45-49      30-34
Q3                                   United States of America  Indonesia
...                                                       ...        ...
Q50_Part_5                                                NaN        NaN
Q50_Part_6                                                NaN        NaN
Q50_Part_7                                                NaN        NaN
Q50_Part_8                                                NaN        NaN
Q50_OTHER_TEXT                                             -1         -1

[395 rows x 2 columns]

## 3.6 存取資料庫

In [53]:
import sqlite3
con = sqlite3.connect('data/beat.db')
with con:
    cur = con.cursor()
    cur.execute("""DROP TABLE Band""")
    cur.execute("""CREATE TABLE Band(id INTEGER PRIMARY KEY,
                   fname TEXT, lname TEXT, birthyear INT)""")
    cur.execute("""INSERT INTO Band VALUES(
                   0, 'Paul', 'McCartney', 1942)""")
    cur.execute("""INSERT INTO Band VALUES(
                   1, 'John', 'Lennon', 1940)""")
    _ = con.commit()

In [54]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\aaronhsu\miniconda38\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\aaronhsu\miniconda38\lib\site-packages (from sqlalchemy) (1.1.2)

WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)

In [55]:
import sqlalchemy as sa
engine = sa.create_engine('sqlite:///data/beat.db', echo=True)
sa_connection = engine.connect()

beat = pd.read_sql('Band', sa_connection, index_col='id')
beat

2022-08-30 02:47:08,689 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Band")
2022-08-30 02:47:08,690 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-08-30 02:47:08,691 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-08-30 02:47:08,692 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-08-30 02:47:08,694 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("Band")
2022-08-30 02:47:08,695 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-08-30 02:47:08,696 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2022-08-30 02:47:08,697 INFO sqlalchemy.engine.Engine [raw sql] ('Band',)
2022-08-30 02:47:08,698 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("Band")
2022-08-30 02:47:08,699 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-08-30 02:47:08,700 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("Band")
2022-08-30 02:47:08,701 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-08-30 02:47:08,701 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2022-08-30 02:47:08,702 INFO sqlalchemy.engine.Engine [raw sql] ('Band',)
2022-08-30 02:47:08,704 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("Band")
2022-08-30 02:47:08,704 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-08-30 02:47:08,706 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("Band")
2022-08-30 02:47:08,706 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-08-30 02:47:08,707 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("Band")
2022-08-30 02:47:08,707 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-08-30 02:47:08,709 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("Band")
2022-08-30 02:47:08,710 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-08-30 02:47:08,711 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2022-08-30 02:47:08,712 INFO sqlalchemy.engine.Engine [raw sql] ('Band',)
2022-08-30 02:47:08,716 INFO sqlalchemy.engine.Engine SELECT "Band".id, "Band".fname, "Band".lname, "Band".birthyear
FROM "Band"
2022-08-30 02:47:08,718 INFO sqlalchemy.engine.Engine [generated in 0.00167s] ()

   fname      lname  birthyear
id
0   Paul  McCartney       1942
1   John     Lennon       1940

In [56]:
sql = '''SELECT fname, birthyear from Band'''
fnames = pd.read_sql(sql, con)
fnames

  fname  birthyear
0  Paul       1942
1  John       1940

## 3.7 存取JSON格式的資料

In [57]:
import json
encoded = json.dumps(people)
encoded

'{"first": ["Paul", "John", "Richard", "George"], "last": ["McCartney", "Lennon", "Starkey", "Harrison"], "birth": [1942, 1940, 1940, 1943]}'

In [58]:
json.loads(encoded)

{'first': ['Paul', 'John', 'Richard', 'George'],
 'last': ['McCartney', 'Lennon', 'Starkey', 'Harrison'],
 'birth': [1942, 1940, 1940, 1943]}

In [59]:
beatles = pd.read_json(encoded)
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [60]:
records = beatles.to_json(orient='records')
records

'[{"first":"Paul","last":"McCartney","birth":1942},{"first":"John","last":"Lennon","birth":1940},{"first":"Richard","last":"Starkey","birth":1940},{"first":"George","last":"Harrison","birth":1943}]'

In [61]:
pd.read_json(records, orient='records')

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [62]:
split = beatles.to_json(orient='split')
split

'{"columns":["first","last","birth"],"index":[0,1,2,3],"data":[["Paul","McCartney",1942],["John","Lennon",1940],["Richard","Starkey",1940],["George","Harrison",1943]]}'

In [63]:
pd.read_json(split, orient='split')

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [64]:
index = beatles.to_json(orient='index')
index

'{"0":{"first":"Paul","last":"McCartney","birth":1942},"1":{"first":"John","last":"Lennon","birth":1940},"2":{"first":"Richard","last":"Starkey","birth":1940},"3":{"first":"George","last":"Harrison","birth":1943}}'

In [65]:
pd.read_json(index, orient='index')

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [66]:
values = beatles.to_json(orient='values')
values

'[["Paul","McCartney",1942],["John","Lennon",1940],["Richard","Starkey",1940],["George","Harrison",1943]]'

In [67]:
pd.read_json(values, orient='values')

         0          1     2
0     Paul  McCartney  1942
1     John     Lennon  1940
2  Richard    Starkey  1940
3   George   Harrison  1943

In [68]:
(pd.read_json(values, orient='values')
   .rename(columns=dict(enumerate(['first', 'last', 'birth'])))
)

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [69]:
table = beatles.to_json(orient='table')
table

'{"schema":{"fields":[{"name":"index","type":"integer"},{"name":"first","type":"string"},{"name":"last","type":"string"},{"name":"birth","type":"integer"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":0,"first":"Paul","last":"McCartney","birth":1942},{"index":1,"first":"John","last":"Lennon","birth":1940},{"index":2,"first":"Richard","last":"Starkey","birth":1940},{"index":3,"first":"George","last":"Harrison","birth":1943}]}'

In [70]:
pd.read_json(table, orient='table')

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [71]:
output = beat.to_dict()
output

{'fname': {0: 'Paul', 1: 'John'},
 'lname': {0: 'McCartney', 1: 'Lennon'},
 'birthyear': {0: 1942, 1: 1940}}

In [72]:
output['version'] = '0.4.1'
json.dumps(output)

'{"fname": {"0": "Paul", "1": "John"}, "lname": {"0": "McCartney", "1": "Lennon"}, "birthyear": {"0": 1942, "1": 1940}, "version": "0.4.1"}'

## 3.8 讀取HTML表格

In [73]:
!pip install lxml

Requirement already satisfied: lxml in c:\users\aaronhsu\miniconda38\lib\site-packages (4.9.1)

WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)

In [74]:
url ='https://en.wikipedia.org/wiki/The_Beatles_discography'
dfs = pd.read_html(url)
len(dfs)

58

In [75]:
dfs[0]

  The Beatles discography The Beatles discography.1
0     The Beatles in 1965       The Beatles in 1965
1           Studio albums          12 (UK), 17 (US)
2             Live albums                         6
3      Compilation albums                        54
4            Video albums                        22
5            Music videos                        68
6                     EPs                        36
7                 Singles                        63
8                Mash-ups                         2
9                Box sets                        17

In [76]:
url ='https://en.wikipedia.org/wiki/The_Beatles_discography'
dfs = pd.read_html(url, match='List of studio albums', na_values='—')
len(dfs)

2

In [77]:
dfs[0].columns

MultiIndex([(               'Title',          'Title'),
            (       'Album details',  'Album details'),
            ('Peak chart positions',       'UK[6][7]'),
            ('Peak chart positions',         'AUS[8]'),
            ('Peak chart positions',         'CAN[9]'),
            ('Peak chart positions',        'FRA[10]'),
            ('Peak chart positions',        'GER[11]'),
            ('Peak chart positions',        'NOR[12]'),
            ('Peak chart positions',     'US[13][14]'),
            (      'Certifications', 'Certifications'),
            (               'Sales',          'Sales')],
           )

In [78]:
url ='https://en.wikipedia.org/wiki/The_Beatles_discography'
dfs = pd.read_html(url, match='List of studio albums', na_values='—',
                   header=[0,1])
len(dfs)

2

In [82]:
dfs[0].head()

                 Title                                      Album details  \
                 Title                                      Album details
0     Please Please Me     Released: 22 March 1963 Label: Parlophone (UK)
1  With the Beatles[B]  Released: 22 November 1963 Label: Parlophone (...
2   A Hard Day's Night      Released: 10 July 1964 Label: Parlophone (UK)
3     Beatles for Sale   Released: 4 December 1964 Label: Parlophone (UK)
4                Help!     Released: 6 August 1965 Label: Parlophone (UK)

  Peak chart positions                                                   \
              UK[6][7] AUS[8] CAN[9] FRA[10] GER[11] NOR[12] US[13][14]
0                    1    NaN    NaN       5       5     NaN        NaN
1                    1    NaN    NaN       5       1     NaN        NaN
2                    1      1    NaN     NaN       1     NaN        NaN
3                    1      1    NaN     NaN       1     NaN          1
4                    1      1    NaN       5       1     NaN        NaN

                                      Certifications            Sales
                                      Certifications            Sales
0  BPI: Platinum[15] ARIA: Gold[16] MC: Gold[17] ...              NaN
1  BPI: Gold[15] ARIA: Gold[16] BVMI: Gold[19] MC...              NaN
2                   BPI: Platinum[15] ARIA: Gold[16]              NaN
3  BPI: Gold[15] ARIA: Gold[16] MC: Gold[17] RIAA...  UK: 750,000[20]
4                   BPI: Platinum[15] ARIA: Gold[16]              NaN

In [83]:
dfs[0].columns

MultiIndex([(               'Title',          'Title'),
            (       'Album details',  'Album details'),
            ('Peak chart positions',       'UK[6][7]'),
            ('Peak chart positions',         'AUS[8]'),
            ('Peak chart positions',         'CAN[9]'),
            ('Peak chart positions',        'FRA[10]'),
            ('Peak chart positions',        'GER[11]'),
            ('Peak chart positions',        'NOR[12]'),
            ('Peak chart positions',     'US[13][14]'),
            (      'Certifications', 'Certifications'),
            (               'Sales',          'Sales')],
           )

In [85]:
df = dfs[0]
df.columns = ['Title', 'Release', 'UK', 'AUS', 'CAN', 'FRA', 'GER',
              'NOR', 'US', 'Certifications', 'Sales']
df.head()

,Title,Release,UK,AUS,CAN,FRA,GER,NOR,US,Certifications,Sales
0,Please Please Me,Released: 22 March 1963 Label: Parlophone (UK),1,NaN,NaN,5,5,NaN,NaN,BPI: Platinum[15] ARIA: Gold[16] MC: Gold[17] ...,NaN
1,With the Beatles[B],Released: 22 November 1963 Label: Parlophone (...,1,NaN,NaN,5,1,NaN,NaN,BPI: Gold[15] ARIA: Gold[16] BVMI: Gold[19] MC...,NaN
2,A Hard Day's Night,Released: 10 July 1964 Label: Parlophone (UK),1,1,NaN,NaN,1,NaN,NaN,BPI: Platinum[15] ARIA: Gold[16],NaN
3,Beatles for Sale,Released: 4 December 1964 Label: Parlophone (UK),1,1,NaN,NaN,1,NaN,1,BPI: Gold[15] ARIA: Gold[16] MC: Gold[17] RIAA...,"UK: 750,000[20]"
4,Help!,Released: 6 August 1965 Label: Parlophone (UK),1,1,NaN,5,1,NaN,NaN,BPI: Platinum[15] ARIA: Gold[16],NaN

In [86]:
# !pip install html5lib

Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
     -------------------------------------- 112.2/112.2 kB 1.1 MB/s eta 0:00:00
Requirement already satisfied: webencodings in c:\users\aaronhsu\miniconda38\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\users\aaronhsu\miniconda38\lib\site-packages (from html5lib) (1.15.0)
Installing collected packages: html5lib
Successfully installed html5lib-1.1

WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\aaronhsu\miniconda38\lib\site-packages)

In [2]:
url = 'https://github.com/mattharrison/datasets/blob/master/data/anscombes.csv'
dfs = pd.read_html(url, attrs={'class': 'csv-data'})
len(dfs)

1

In [4]:
dfs[0].head()

   Unnamed: 0 quadrant     x     y
0         NaN        I  10.0  8.04
1         NaN        I  14.0  9.96
2         NaN        I   6.0  7.24
3         NaN        I   9.0  8.81
4         NaN        I   4.0  4.26